music_app/app/views/albums/show.html.erb

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  <% when "band_id" %>
    <%= "Band: #{Band.find(@album.band_id).name}" %>

SELECT "tracks".* FROM "tracks" WHERE "tracks"."album_id" = $1  [["album_id", 2]]
---
<ul class="tracks">
  <% @album.tracks.each do |track| %>